/* automatically generated by rust-bindgen */

pub const FFTW_FORWARD: i32 = -1;
pub const FFTW_BACKWARD: u32 = 1;
pub const FFTW_NO_TIMELIMIT: f64 = -1.0;
pub const FFTW_MEASURE: u32 = 0;
pub const FFTW_DESTROY_INPUT: u32 = 1;
pub const FFTW_UNALIGNED: u32 = 2;
pub const FFTW_CONSERVE_MEMORY: u32 = 4;
pub const FFTW_EXHAUSTIVE: u32 = 8;
pub const FFTW_PRESERVE_INPUT: u32 = 16;
pub const FFTW_PATIENT: u32 = 32;
pub const FFTW_ESTIMATE: u32 = 64;
pub const FFTW_WISDOM_ONLY: u32 = 2097152;
pub const FFTW_ESTIMATE_PATIENT: u32 = 128;
pub const FFTW_BELIEVE_PCOST: u32 = 256;
pub const FFTW_NO_DFT_R2HC: u32 = 512;
pub const FFTW_NO_NONTHREADED: u32 = 1024;
pub const FFTW_NO_BUFFERING: u32 = 2048;
pub const FFTW_NO_INDIRECT_OP: u32 = 4096;
pub const FFTW_ALLOW_LARGE_GENERIC: u32 = 8192;
pub const FFTW_NO_RANK_SPLITS: u32 = 16384;
pub const FFTW_NO_VRANK_SPLITS: u32 = 32768;
pub const FFTW_NO_VRECURSE: u32 = 65536;
pub const FFTW_NO_SIMD: u32 = 131072;
pub const FFTW_NO_SLOW: u32 = 262144;
pub const FFTW_NO_FIXED_RADIX_LARGE_N: u32 = 524288;
pub const FFTW_ALLOW_PRUNING: u32 = 1048576;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
pub enum fftw_r2r_kind_do_not_use_me {
    FFTW_R2HC = 0,
    FFTW_HC2R = 1,
    FFTW_DHT = 2,
    FFTW_REDFT00 = 3,
    FFTW_REDFT01 = 4,
    FFTW_REDFT10 = 5,
    FFTW_REDFT11 = 6,
    FFTW_RODFT00 = 7,
    FFTW_RODFT01 = 8,
    FFTW_RODFT10 = 9,
    FFTW_RODFT11 = 10,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct fftw_iodim_do_not_use_me {
    pub n: ::std::os::raw::c_int,
    pub is: ::std::os::raw::c_int,
    pub os: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_fftw_iodim_do_not_use_me() {
    assert_eq!(
        ::core::mem::size_of::<fftw_iodim_do_not_use_me>(),
        12usize,
        concat!("Size of: ", stringify!(fftw_iodim_do_not_use_me))
    );
    assert_eq!(
        ::core::mem::align_of::<fftw_iodim_do_not_use_me>(),
        4usize,
        concat!("Alignment of ", stringify!(fftw_iodim_do_not_use_me))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<fftw_iodim_do_not_use_me>())).n as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fftw_iodim_do_not_use_me),
            "::",
            stringify!(n)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<fftw_iodim_do_not_use_me>())).is as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fftw_iodim_do_not_use_me),
            "::",
            stringify!(is)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<fftw_iodim_do_not_use_me>())).os as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fftw_iodim_do_not_use_me),
            "::",
            stringify!(os)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct fftw_iodim64_do_not_use_me {
    pub n: isize,
    pub is: isize,
    pub os: isize,
}
#[test]
fn bindgen_test_layout_fftw_iodim64_do_not_use_me() {
    assert_eq!(
        ::core::mem::size_of::<fftw_iodim64_do_not_use_me>(),
        24usize,
        concat!("Size of: ", stringify!(fftw_iodim64_do_not_use_me))
    );
    assert_eq!(
        ::core::mem::align_of::<fftw_iodim64_do_not_use_me>(),
        8usize,
        concat!("Alignment of ", stringify!(fftw_iodim64_do_not_use_me))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<fftw_iodim64_do_not_use_me>())).n as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fftw_iodim64_do_not_use_me),
            "::",
            stringify!(n)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<fftw_iodim64_do_not_use_me>())).is as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fftw_iodim64_do_not_use_me),
            "::",
            stringify!(is)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<fftw_iodim64_do_not_use_me>())).os as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fftw_iodim64_do_not_use_me),
            "::",
            stringify!(os)
        )
    );
}
pub type fftw_write_char_func_do_not_use_me = ::core::option::Option<
    unsafe extern "C" fn(c: ::std::os::raw::c_char, arg1: *mut ::core::ffi::c_void),
>;
pub type fftw_read_char_func_do_not_use_me = ::core::option::Option<
    unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fftw_plan_s {
    _unused: [u8; 0],
}
pub type fftw_plan = *mut fftw_plan_s;
pub type fftw_iodim = fftw_iodim_do_not_use_me;
pub type fftw_iodim64 = fftw_iodim64_do_not_use_me;
pub use self::fftw_r2r_kind_do_not_use_me as fftw_r2r_kind;
pub type fftw_write_char_func = fftw_write_char_func_do_not_use_me;
pub type fftw_read_char_func = fftw_read_char_func_do_not_use_me;
extern "C" {
    pub fn fftw_execute(p: fftw_plan);
}
extern "C" {
    pub fn fftw_plan_dft(
